Repository: ipabuyer/ipabuyer
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans

# AppDescription
source: Quickly purchase and download apps from the App Store
zh_hans: 快速购买和下载 App Store 中的应用

# Settings/Button/EditCountryCode.Content
source: Edit
zh_hans: 修改

# Settings/Button/OpenDeveloperSite.Content
source: Open website
zh_hans: 打开网站

# Settings/Button/PickDownloadDirectory.Content
source: Change location
zh_hans: 修改路径

# Settings/Button/ResetDownloadDirectory.Content
source: Restore default
zh_hans: 恢复默认

# Settings/Button/OpenProjectRepository.Content
source: Open repository
zh_hans: 打开仓库

# Settings/Button/ClearLocalDatabase.Content
source: Clear records
zh_hans: 清空记录

# Common/AppleAccount/OpenButton.Content
source: Open the official Apple account website
zh_hans: 打开苹果账户官网

# Settings/CountryCode/CancelButton
source: Cancel
zh_hans: 取消

# Settings/CountryCode/CurrentFormat
source: Current: {0}
zh_hans: 当前: {0}

# Settings/CountryCode/DialogTitle
source: Choose a country or region
zh_hans: 选择国家/地区

# Settings/CountryCode/SearchPlaceholder
source: Search for a country, region or code
zh_hans: 搜索国家、地区或代码

# Settings/CountryCode/NoResults
source: No matching country or region found
zh_hans: 未找到匹配的国家或地区

# Settings/CountryCode/SaveButton
source: save
zh_hans: 保存

# Settings/CountryCode/SaveFailMessage
source: Failed to save: {0}
zh_hans: 保存失败：{0}

# Settings/CountryCode/UpdatedMessage
source: Country code updated to {0}
zh_hans: 国家/地区代码已更新为 {0}

# Settings/Database/Clear/ConfirmMessage
source: Are you sure you want to clear the purchased records in the local database? {0}Current number of records: {1}. {0}This operation is irreversible.
zh_hans: 确定要清空本地数据库中的已购买记录吗？{0}当前记录数：{1} 条。{0}此操作不可恢复。

# Settings/Database/Clear/FailMessage
source: Clear failed: {0}
zh_hans: 清空失败：{0}

# Settings/Database/Clear/SuccessMessage
source: Local records have been cleared. {0} Before clearing: {1} items, after clearing: {2} items.
zh_hans: 本地记录已清空。{0}清空前：{1} 条，清空后：{2} 条。

# Settings/Dialog/CloseButton
source: Sure
zh_hans: 确定

# Settings/Dialog/ConfirmAction/Close
source: Cancel
zh_hans: 取消

# Settings/Dialog/ConfirmAction/Primary
source: Confirm clearing
zh_hans: 确认清空

# Settings/Dialog/ConfirmAction/Title
source: Confirm action
zh_hans: 确认操作

# Settings/Dialog/ErrorTitle
source: mistake
zh_hans: 错误

# Settings/Dialog/OperationFailedTitle
source: Operation failed
zh_hans: 操作失败

# Settings/Dialog/SuccessTitle
source: Operation successful
zh_hans: 操作成功

# Settings/DownloadDirectory/ResetFailMessage
source: Failed to restore default directory: {0}
zh_hans: 恢复默认目录失败：{0}

# Settings/DownloadDirectory/ResetSuccessMessage
source: Default download directory restored: {0}
zh_hans: 已恢复默认下载目录：{0}

# Settings/DownloadDirectory/SaveFailMessage
source: Failed to save: {0}
zh_hans: 保存失败：{0}

# Settings/DownloadDirectory/UpdatedMessage
source: Download directory has been updated
zh_hans: 下载目录已更新

# Settings/Card/ClearLocalDatabase.Description
source: Only clears local records and does not affect Apple purchase history.
zh_hans: 仅清除本地记录，不影响 Apple 购买历史。

# Settings/Card/ClearLocalDatabase.Header
source: Clear local purchase history
zh_hans: 清空本地购买记录

# Settings/Card/CountryCode.Description
source: For query and purchase, select from countries or regions supported by the App Store.
zh_hans: 用于查询与购买，可从 App Store 支持的国家/地区中选择。

# Settings/Card/CountryCode.Header
source: Country code
zh_hans: 国家/地区代码

# Settings/Card/DeveloperSite.Header
source: Developer website
zh_hans: 开发者网站

# Settings/Card/DownloadDirectory.Description
source: The location where downloaded files are saved.
zh_hans: 下载文件保存位置。

# Settings/Card/DownloadDirectory.Header
source: Download catalog
zh_hans: 下载目录

# Settings/Card/AppVersion.Header
source: Software version
zh_hans: 软件版本

# Settings/Card/ProjectRepository.Description
source: https://github.com/ipabuyer/gui
zh_hans: https://github.com/ipabuyer/ipabuyer

# Settings/Card/ProjectRepository.Header
source: Project repository
zh_hans: 项目仓库

# Settings/Card/OwnedPrompt.Description
source: When turned on, confirmation is skipped when marking an app as "Owned".
zh_hans: 开启后，标记“已拥有”时不再确认。

# Settings/Card/OwnedPrompt.Header
source: "Owned" confirmation dialog
zh_hans: “已拥有”提示弹窗

# Settings/Card/KeychainPassphraseRotation.Description
source: When turned off, new encryption keys will no longer be automatically generated when logging out.
zh_hans: 关闭后，退出登录时不再自动生成新的加密密钥。

# Settings/Card/KeychainPassphraseRotation.Header
source: Encryption key rotation
zh_hans: 加密密钥轮换

# MainWindow/TitleBarSubtitle
source: Quickly purchase apps from the AppStore
zh_hans: 快速购买AppStore中的应用

# MainWindow/SearchBox.PlaceholderText
source: Search app name
zh_hans: 搜索 App 名称

# MainWindow/LoginStatus/LoggedIn
source: Logged in: {0}
zh_hans: 已登录：{0}

# MainWindow/LoginStatus/LoggedOut
source: Not logged in
zh_hans: 未登录

# MainWindow/Nav/Main.Content
source: Home
zh_hans: 主页

# MainWindow/Nav/Account.Content
source: Account
zh_hans: 账户

# MainWindow/Nav/Downloads.Content
source: download
zh_hans: 下载

# MainWindow/Nav/Settings.Content
source: set up
zh_hans: 设置

# IpatoolPage/DescriptionTextBlock.Text
source: You can switch between the built-in official version of ipatool and customized ipatool.exe.
zh_hans: 可在内置正式版 ipatool 与自定义 ipatool.exe 之间切换。

# IpatoolPage/Card/Release.Header
source: Built-in ipatool
zh_hans: 内置 ipatool

# IpatoolPage/Release/DisplayName
source: Built-in official version of ipatool
zh_hans: 内置正式版 ipatool

# IpatoolPage/Release/MenuButton.ToolTipService.ToolTip
source: More actions
zh_hans: 更多操作

# IpatoolPage/Release/Menu/Export.Text
source: Export
zh_hans: 导出

# IpatoolPage/Badge/Current
source: currently in use
zh_hans: 当前使用

# IpatoolPage/Card/Custom.Header
source: Customize ipatool.exe
zh_hans: 自定义 ipatool.exe

# IpatoolPage/Custom/EmptyPath
source: not set
zh_hans: 未设置

# IpatoolPage/Custom/MenuButton.ToolTipService.ToolTip
source: More actions
zh_hans: 更多操作

# IpatoolPage/Custom/Menu/Delete.Text
source: delete
zh_hans: 删除

# IpatoolPage/Button/Pick
source: choose
zh_hans: 选择

# IpatoolPage/Button/Replace
source: replace
zh_hans: 更换

# IpatoolPage/Button/Use
source: use
zh_hans: 使用

# IpatoolPage/Custom/DeleteConfirmTitle
source: Delete custom slot
zh_hans: 删除自定义插槽

# IpatoolPage/Custom/DeleteConfirmMessage
source: The current custom ipatool.exe path will be removed, the file itself will not be deleted.
zh_hans: 将移除当前自定义 ipatool.exe 路径，文件本身不会被删除。

# IpatoolPage/Custom/DeleteConfirmPrimary
source: delete
zh_hans: 删除

# IpatoolPage/Custom/SaveFailMessage
source: Failed to save custom ipatool.exe: {0}
zh_hans: 保存自定义 ipatool.exe 失败：{0}

# IpatoolPage/Export/AlreadyInTargetMessage
source: ipatool.exe is already located in the target directory: {0}
zh_hans: ipatool.exe 已位于目标目录：{0}

# IpatoolPage/Export/ConfirmMessage
source: Will export {0} to the following directory: {1}
zh_hans: 将导出 {0} 到以下目录：{1}

# IpatoolPage/Export/ConfirmPrimary
source: Export
zh_hans: 导出

# IpatoolPage/Export/ConfirmTitle
source: Confirm export
zh_hans: 确认导出

# IpatoolPage/Export/FailMessage
source: Export of ipatool.exe failed: {0}
zh_hans: 导出 ipatool.exe 失败：{0}

# IpatoolPage/Export/NotFoundMessage
source: Exportable {0} not found in application directory.
zh_hans: 未在应用目录中找到可导出的 {0}。

# IpatoolPage/Export/OverwriteMessage
source: The target file already exists, continuing to export will overwrite: {0}
zh_hans: 目标文件已存在，继续导出会覆盖：{0}

# IpatoolPage/Export/OverwritePrimary
source: cover
zh_hans: 覆盖

# IpatoolPage/Export/OverwriteTitle
source: Confirm coverage
zh_hans: 确认覆盖

# IpatoolPage/Export/SuccessMessage
source: {0} has been exported to: {1}
zh_hans: {0} 已导出到：{1}

# IpatoolPage/Card/DetailedIpatoolLog.Header
source: Show detailed log
zh_hans: 显示详细日志

# IpatoolPage/Card/DetailedIpatoolLog.Description
source: Display the complete ipatool command and output.
zh_hans: 显示完整的 ipatool 命令与输出。

# IpatoolPage/Card/ClearIpatoolData.Header
source: Clear ipatool data
zh_hans: 清空 ipatool 数据

# IpatoolPage/Card/ClearIpatoolData.Description
source: Clear local cache and authentication data.
zh_hans: 清除本机缓存与认证数据。

# IpatoolPage/ClearIpatoolDataButton.Content
source: Clear data
zh_hans: 清空数据

# IpatoolPage/Data/ClearConfirmMessage
source: Are you sure you want to clear the following directories? {0}{1}{0}This operation is irreversible.
zh_hans: 确定要清空以下目录吗？{0}{1}{0}此操作不可恢复。

# IpatoolPage/Data/ClearFailMessage
source: Failed to clear ipatool data: {0}
zh_hans: 清空 ipatool 数据失败：{0}

# IpatoolPage/Data/ClearSuccessMessage
source: The ipatool data directory has been cleared.
zh_hans: ipatool 数据目录已清空。

# IpatoolPage/Card/Repository.Header
source: ipatool repository
zh_hans: ipatool 仓库

# IpatoolPage/Repository/OpenButton.Content
source: Open
zh_hans: 打开

# MainPage/Action/BatchPurchaseButton.Content
source: Buy
zh_hans: 购买

# MainPage/Action/AddToQueueButton.Content
source: download
zh_hans: 下载

# MainPage/Action/CancelAllDownloadsButton.Content
source: Terminate download
zh_hans: 终止下载

# MainPage/DownloadQueue/ActivityRing.AutomationProperties.Name
source: Download in progress
zh_hans: 下载进行中

# MainPage/DownloadQueue/ActivityRing.ToolTipService.ToolTip
source: Download in progress
zh_hans: 下载进行中

# MainPage/Action/OpenLogButton.Content
source: log
zh_hans: 日志

# MainPage/Filter/AllItem.Content
source: all
zh_hans: 全部

# MainPage/Filter/OnlyNotPurchasedItem.Content
source: Not purchased
zh_hans: 未购买

# MainPage/Filter/OnlyPurchasedItem.Content
source: Purchased
zh_hans: 已购买

# MainPage/Filter/OnlyOwnedItem.Content
source: Already owned
zh_hans: 已拥有

# MainPage/Header/NameButton.Content
source: App name
zh_hans: App名称

# MainPage/Header/DeveloperButton.Content
source: Developer
zh_hans: 开发者

# MainPage/Header/VersionButton.Content
source: version number
zh_hans: 版本号

# MainPage/Header/PriceButton.Content
source: price
zh_hans: 价格

# MainPage/Header/PurchasedButton.Content
source: Purchase status
zh_hans: 购买状态

# MainPage/Context/PurchaseItem.Text
source: Buy
zh_hans: 购买

# MainPage/Context/AddToQueueItem.Text
source: download
zh_hans: 下载

# MainPage/Context/MarkNotPurchasedItem.Text
source: Mark as not purchased
zh_hans: 标记为未购买

# MainPage/Context/MarkPurchasedItem.Text
source: Mark as purchased
zh_hans: 标记为已购买

# MainPage/Context/MarkOwnedItem.Text
source: Mark as owned
zh_hans: 标记为已拥有

# MainPage/Context/CopyNameItem.Text
source: Copy app name
zh_hans: 复制 App 名称

# MainPage/Context/CopyIdItem.Text
source: Copy App ID
zh_hans: 复制 App ID

# MainPage/Context/OpenAppStoreItem.Text
source: View in the App Store
zh_hans: 在 App Store 中查看

# MainPage/Context/CopyVersionItem.Text
source: copy version number
zh_hans: 复制版本号

# MainPage/Log/TitleText.Text
source: log
zh_hans: 日志

# MainPage/Log/CopyButton.Content
source: Copy
zh_hans: 复制

# MainPage/Log/ClearButton.Content
source: Clear
zh_hans: 清空

# MainPage/DownloadQueue/AddSelectedIgnored
source: The selected app cannot be queued for download.
zh_hans: 所选应用无法加入下载队列。

# MainPage/DownloadQueue/AddSelectedEmpty
source: No app selected, download cannot start.
zh_hans: 未选择应用，无法开始下载。

# MainPage/DownloadQueue/AddContextIgnored
source: The right-click target cannot be added to the download queue.
zh_hans: 右键目标无法加入下载队列。

# MainPage/DownloadQueue/AddContextEmpty
source: The right-click target is empty and cannot be added to the download queue.
zh_hans: 右键目标为空，无法加入下载队列。

# MainPage/DownloadQueue/ContextAddSummaryPrefix
source: Right click {0}
zh_hans: 右键{0}

# MainPage/DownloadQueue/AlreadyRunningContinue
source: The download queue is already running and the new task will continue processing after the current task.
zh_hans: 下载队列已在运行，新任务会在当前任务后继续处理。

# MainPage/DownloadQueue/AddSummaryAddedAndUpdated
source: Added to download queue: {0} items, updated: {1} items.
zh_hans: 已加入下载队列: {0} 项，更新: {1} 项。

# MainPage/DownloadQueue/AddSummaryAdded
source: Added to download queue: {0} items.
zh_hans: 已加入下载队列: {0} 项。

# MainPage/DownloadQueue/AddSummaryUpdated
source: Download queue updated: {0} items.
zh_hans: 已更新下载队列: {0} 项。

# MainPage/DownloadQueue/StartFailed
source: Failed to start download: {0}
zh_hans: 开始下载失败: {0}

# MainPage/Log/SearchEmptyIgnored
source: Search term is empty and ignored.
zh_hans: 搜索词为空，已忽略。

# MainPage/Log/SearchStarted
source: Start search: {0}
zh_hans: 开始搜索: {0}

# MainPage/Log/SearchException
source: Search exception: {0}
zh_hans: 搜索异常: {0}

# MainPage/Log/SearchTimeoutOrEmpty
source: The search timed out or returned no results.
zh_hans: 搜索超时或无返回结果。

# MainPage/Log/SearchCompleted
source: Search completed, {0} results in total.
zh_hans: 搜索完成，共 {0} 条结果。

# MainPage/Log/SearchParseFailed
source: Failed to parse search results.
zh_hans: 搜索结果解析失败。

# MainPage/Log/BatchPurchaseEmpty
source: No apps are selected and cannot be purchased in bulk.
zh_hans: 未选择应用，无法批量购买。

# MainPage/Log/BatchPurchaseStarted
source: Start buying in bulk of {0} items.
zh_hans: 开始批量购买，共 {0} 项。

# MainPage/Log/BatchPurchaseCompleted
source: Bulk purchase execution completed.
zh_hans: 批量购买执行完成。

# MainPage/Log/BatchPurchaseCanceled
source: Bulk purchase has been cancelled.
zh_hans: 批量购买已取消。

# MainPage/Log/BatchPurchaseException
source: Bulk purchase exception: {0}
zh_hans: 批量购买异常: {0}

# MainPage/Log/ContextPurchaseStarted
source: Right click to buy, {0} items in total.
zh_hans: 右键购买，共 {0} 项。

# MainPage/Log/ContextPurchaseCanceled
source: Right click purchase has been cancelled.
zh_hans: 右键购买已取消。

# MainPage/Log/ContextPurchaseException
source: Right-click purchase exception: {0}
zh_hans: 右键购买异常: {0}

# MainPage/Log/MarkedStatus
source: {0} items have been marked {1}.
zh_hans: 已标记 {0} 项为 {1}。

# MainPage/Log/CopyFieldEmpty
source: Copy failed: {0} is empty.
zh_hans: 复制失败：{0}为空。

# MainPage/Log/CopyFieldSuccess
source: {0} of {1} items copied.
zh_hans: 已复制{0}，共 {1} 项。

# MainPage/Log/AppStoreMissingId
source: Unable to open App Store: Missing App Store ID.
zh_hans: 无法打开 App Store：缺少 App Store ID。

# MainPage/Log/AppStoreOpened
source: App Store opened: {0}.
zh_hans: 已打开 App Store：{0}。

# MainPage/Log/AppStoreOpenFailed
source: Failed to open App Store: {0}
zh_hans: 打开 App Store 失败：{0}

# MainPage/Log/FilterChanged
source: Toggle filter: {0}
zh_hans: 切换筛选: {0}

# MainPage/Log/CopyEmptyLog
source: The log is empty and has no content to copy.
zh_hans: 日志为空，无可复制内容。

# MainPage/Log/CopiedToClipboard
source: Log copied to clipboard.
zh_hans: 日志已复制到剪贴板。

# MainPage/Log/Cleared
source: The log has been cleared.
zh_hans: 日志已清空。

# MainPage/Field/Name
source: App name
zh_hans: App 名称

# MainPage/Field/Version
source: version number
zh_hans: 版本号

# MainPage/Purchase/MissingSessionEmail
source: The current login status has not obtained the email address. Please log out and log in again on the account page.
zh_hans: 当前登录状态未获取到邮箱，请先在账户页面退出并重新登录。

# MainPage/Purchase/LoginRequired
source: Please log in to the account page before purchasing.
zh_hans: 请先在账户页面登录后再购买。

# MainPage/Purchase/SkipNonFree
source: Not free app, purchase skipped: {0}
zh_hans: 非免费应用，已跳过购买: {0}

# MainPage/PurchaseBlockedReason/NonFree
source: The current price is {0}, and this software only supports the purchase of free apps.
zh_hans: 当前价格为 {0}，本软件仅支持购买免费 App。

# MainPage/PurchaseBlockedReason/Unknown
source: This app is not currently available for purchase. It may not be a free app or may not be available for purchase on the App Store.
zh_hans: 该 App 当前不可购买，可能不是免费 App 或 App Store 暂不允许购买。

# MainPage/Purchase/MockSuccess
source: Test account purchase successful: {0}
zh_hans: 测试账户购买成功: {0}

# MainPage/Purchase/Success
source: Purchase successful: {0}
zh_hans: 购买成功: {0}

# MainPage/Purchase/OwnedDetected
source: Already own: {0}
zh_hans: 已拥有: {0}

# MainPage/Purchase/OwnedMarked
source: Suspected to be owned, marked: {0}
zh_hans: 疑似已拥有，已标记: {0}

# MainPage/Purchase/OwnedNotMarked
source: Suspected to be owned, unmarked: {0}
zh_hans: 疑似已拥有，未标记: {0}

# MainPage/Purchase/UnknownError
source: unknown error
zh_hans: 未知错误

# MainPage/Purchase/Failed
source: Purchase failed: {0} - {1}
zh_hans: 购买失败: {0} - {1}

# MainPage/OwnedPrompt/DisablePrompt
source: No more prompts, just mark it as owned in the future.
zh_hans: 不再提示，后续直接标记为已拥有

# MainPage/OwnedPrompt/Message
source: ipatool returns STDQ: {0} may be owned, is it marked as "owned"?
zh_hans: ipatool 返回 STDQ：{0} 可能已拥有，是否标记为“已拥有”？

# MainPage/OwnedPrompt/Title
source: Suspected to have
zh_hans: 疑似已拥有

# MainPage/OwnedPrompt/PrimaryButton
source: Mark as owned
zh_hans: 标记为已拥有

# Common/Cancel
source: Cancel
zh_hans: 取消

# Common/Status/Purchased
source: Purchased
zh_hans: 已购买

# Common/Status/Owned
source: Already owned
zh_hans: 已拥有

# Common/Status/NotPurchased
source: Not purchased
zh_hans: 未购买

# Common/Status/CanPurchase
source: available for purchase
zh_hans: 可购买

# Common/Status/PurchaseBlocked
source: Unable to purchase
zh_hans: 无法购买

# Common/Price/Free
source: free
zh_hans: 免费

# DownloadQueue/Status/Pending
source: Waiting for download
zh_hans: 等待下载

# DownloadQueue/Status/Downloading
source: Downloading
zh_hans: 下载中

# DownloadQueue/Status/RequestingLicense
source: Requesting license
zh_hans: 正在请求许可证

# DownloadQueue/Status/ProcessingResult
source: Processing download result
zh_hans: 正在处理下载结果

# DownloadQueue/Status/Success
source: Download successful
zh_hans: 下载成功

# DownloadQueue/Status/Failed
source: Download failed
zh_hans: 下载失败

# DownloadQueue/Status/Canceled
source: Download terminated
zh_hans: 下载已终止

# DownloadQueue/Status/CanceledShort
source: terminated
zh_hans: 已终止

# DownloadQueue/Status/QueueCanceled
source: queue terminated
zh_hans: 队列已终止

# DownloadQueue/Status/Requeued
source: Rejoined download queue
zh_hans: 已重新加入下载队列

# DownloadQueue/Log/Updated
source: Queue update: {0} ({1})
zh_hans: 队列更新: {0} ({1})

# DownloadQueue/Log/Added
source: Already added to download queue: {0} ({1})
zh_hans: 已加入下载队列: {0} ({1})

# DownloadQueue/Log/Requeued
source: Rejoined download queue: {0} ({1})
zh_hans: 已重新加入下载队列: {0} ({1})

# DownloadQueue/Log/Removed
source: Removed from download queue: {0} items
zh_hans: 已移出下载队列: {0} 项

# DownloadQueue/Log/AlreadyRunning
source: The download queue is already running
zh_hans: 下载队列已在运行

# DownloadQueue/Log/NoPendingItems
source: No items to download
zh_hans: 没有待下载项目

# DownloadQueue/Log/StartQueue
source: Start download queue, total {0} items, output directory: {1}
zh_hans: 开始下载队列，共 {0} 项，输出目录: {1}

# DownloadQueue/Log/Downloading
source: Downloading: {0}
zh_hans: 正在下载：{0}

# DownloadQueue/Log/RequestingLicense
source: Requesting license: {0}
zh_hans: 正在请求许可证：{0}

# DownloadQueue/Log/ProcessingResult
source: Processing download result: {0}
zh_hans: 正在处理下载结果：{0}

# DownloadQueue/Log/MockSuccess
source: Download successful (test account): {0}
zh_hans: 下载成功(测试账户): {0}

# DownloadQueue/Log/Success
source: Download successful: {0}
zh_hans: 下载成功: {0}

# DownloadQueue/Log/Failed
source: Download failed: {0} - {1}
zh_hans: 下载失败: {0} - {1}

# DownloadQueue/Log/Canceled
source: Download terminated: {0}
zh_hans: 下载已终止: {0}

# DownloadQueue/Log/Exception
source: Download exception: {0} - {1}
zh_hans: 下载异常: {0} - {1}

# DownloadQueue/Log/Completed
source: Download queue completed, successful {0}/{1}
zh_hans: 下载队列完成，成功 {0}/{1}

# DownloadQueue/Log/QueueCanceled
source: Download queue terminated
zh_hans: 下载队列已终止

# DownloadQueue/Log/CancelCurrentRequested
source: Requested to terminate current download task
zh_hans: 已请求终止当前下载任务

# DownloadQueue/Log/CancelAllRequested
source: Requested to terminate all download tasks
zh_hans: 已请求终止所有下载任务

# DownloadQueue/Error/Timeout
source: Download timeout
zh_hans: 下载超时

# DownloadQueue/Error/ExitCode
source: Exit code {0}
zh_hans: 退出码 {0}

# DownloadQueue/Error/MissingSessionEmail
source: The current login status has not obtained the email address. Please log out and log in again on the account page.
zh_hans: 当前登录状态未获取到邮箱，请先在账户页面退出并重新登录

# DownloadQueue/Error/MissingAccount
source: No available account found, please log in first
zh_hans: 未找到可用账号，请先登录

# Ipatool/Error/RequiredArgument
source: {0} cannot be empty
zh_hans: {0} 不能为空

# Ipatool/Error/AppNameRequired
source: Application name cannot be empty
zh_hans: 应用名称不能为空

# Ipatool/Error/HttpRequestFailed
source: Request failed: {0} {1}
zh_hans: 请求失败: {0} {1}

# Ipatool/Error/ExecutionTimeout
source: Execution timeout: {0}
zh_hans: 执行超时: {0}

# Ipatool/Error/ProcessStartFailed
source: Unable to start ipatool process
zh_hans: 无法启动 ipatool 进程

# Ipatool/Error/MissingPassphrase
source: No available encryption key was found, please log in again on the account page and try again.
zh_hans: 未找到可用的加密密钥，请先在账户页面重新登录后再试。

# Ipatool/Error/ReadableJsonError
source: ipatool error: {0} (exit: {1})
zh_hans: ipatool 错误: {0} (exit: {1})

# Ipatool/Error/ExecutionFailed
source: ipatool execution failed (exit: {0})
zh_hans: ipatool 执行失败 (exit: {0})

# Ipatool/Debug/FallbackToPath
source: Private ipatool was not found in the application directory, the executable will be parsed from PATH.
zh_hans: 未在应用目录中找到专用 ipatool，可执行文件将从 PATH 中解析。

# Ipatool/Debug/DeleteCookieLock
source: Delete ipatool cookies.lock: {0}
zh_hans: 删除 ipatool cookies.lock: {0}

# Ipatool/Debug/DeleteCookieLockFailed
source: Deletion of ipatool cookies.lock failed: {0}
zh_hans: 删除 ipatool cookies.lock 失败: {0}

# KeychainConfig/Error/CountryCodeRequired
source: Country code cannot be empty
zh_hans: 国家/地区代码不能为空

# KeychainConfig/Error/CountryCodeInvalid
source: Invalid country code format
zh_hans: 国家/地区代码格式无效

# KeychainConfig/Error/PassphraseRequired
source: Encryption key cannot be empty
zh_hans: 加密密钥不能为空

# KeychainConfig/Error/DownloadDirectoryRequired
source: The download directory cannot be empty
zh_hans: 下载目录不能为空

# KeychainConfig/Error/CustomIpatoolPathRequired
source: Custom ipatool.exe path cannot be empty
zh_hans: 自定义 ipatool.exe 路径不能为空

# KeychainConfig/Error/CustomIpatoolPathNotFound
source: The custom ipatool.exe file does not exist
zh_hans: 自定义 ipatool.exe 文件不存在

# PurchasedAppDb/Error/DatabasePathNotInitialized
source: App database path not initialized
zh_hans: App 数据库路径未初始化

# PurchasedAppDb/Debug/AppIdOrAccountRequired
source: AppID or Account cannot be empty
zh_hans: AppID 或 Account 不能为空

# Database/Debug/Error
source: Database error: {0}
zh_hans: 数据库错误: {0}

# Database/Debug/LocalStatePathMissing
source: Unable to get packaged app LocalState path.
zh_hans: 无法获取 packaged 应用 LocalState 路径。

# Settings/Debug/InitializeCountryCodeFailed
source: Failed to initialize country code: {0}
zh_hans: 初始化国家代码失败: {0}

# Settings/Debug/InitializeDownloadDirectoryFailed
source: Failed to initialize download directory: {0}
zh_hans: 初始化下载目录失败: {0}

# App/Debug/StartupError
source: Startup error: {0}
zh_hans: 启动错误: {0}

# App/Debug/WarmupAuthInfoFailed
source: Silent query login status failed: {0}
zh_hans: 静默查询登录状态失败: {0}

# DownloadsPage/Action/StartQueueButton.Content
source: Start download queue
zh_hans: 开始下载队列

# DownloadsPage/Action/RemoveQueueButton.Content
source: Remove from download queue
zh_hans: 移出下载队列

# DownloadsPage/Action/RemoveSuccessItemsButton.Content
source: Remove successful download items
zh_hans: 移除下载成功项

# DownloadsPage/Action/OpenDirectoryButton.Content
source: Open download directory
zh_hans: 打开下载目录

# DownloadsPage/Action/CancelAllButton.Content
source: Terminate all downloads
zh_hans: 终止所有下载

# DownloadsPage/Header/NameButton.Content
source: App name
zh_hans: App名称

# DownloadsPage/Header/DeveloperButton.Content
source: Developer
zh_hans: 开发者

# DownloadsPage/Header/VersionButton.Content
source: version number
zh_hans: 版本号

# DownloadsPage/Header/PriceButton.Content
source: price
zh_hans: 价格

# DownloadsPage/Header/StatusButton.Content
source: Download status
zh_hans: 下载状态

# DownloadsPage/Log/TitleText.Text
source: log
zh_hans: 日志

# DownloadsPage/Log/CopyButton.Content
source: Copy
zh_hans: 复制

# DownloadsPage/Log/ClearButton.Content
source: Clear
zh_hans: 清空

# DownloadsPage/Log/CancelCurrentButton.Content
source: Terminate current app download
zh_hans: 终止当前app下载
